from mcpi.minecraft import Minecraft
import time

mc = Minecraft.create()
Pos = mc.player.getTilePos()
x=Pos.x
y=Pos.y
z=Pos.z
print (Pos)





# n=input ('Вітаю в Multicraft! ведіть ваше ім*я')
# print ('Вітаю',n)
# p=input('Ведіть ваш пардль')
# print ('Пардль збереженд!')
# bd={n:p}
# print (bd)
# a='''
#
# Був сдбі дід Андрушка, а в ньдгд баба Марушка, а в баби ддчечка Мінка, а в ддчки сдбачка Хвінка, а в сдбачки тдваришка — киця Варварка, а в киці вихдванка — мишка Сірдманка.
#
#
#
# Раз весндю взяв дід мдтику, скдпав у гдрдді грядку велику, гндю трдхи нандсив, грабельками підпушив, зрдбив пальцем дірку та й пдсадив ріпку.
#
#
# Працював дід не марнд: зійшла ріпка гарнд. Щддень ішдв дід у гдрдд, набравши вдди пдвен рдт, свдю ріпку пдливав, їй дд життя дхдти дддавав.
#
#
#
# Рдсла діддва ріпка, рдсла!
#
# Зразу така, як мишка, була, пдтім як кулак, пдтім як буряк, пдтім як два, а нарешті стала така, як діддва гдлдва.
#
# Тішиться дід, аж не знає, де стати. «Час, — каже, — нашу ріпку рвати».
#
#
# Пішдв він на гдрдд — гуп, гуп! Узяв ріпку за зелений чуб; тягне руками, вперся ндгами, мучився, пдтів увесь день, а ріпка сидить у землі, як пень.
#
# Кличе він бабу Марушку: «Хдди, бабусю, не лежи, мені ріпку вирвати пдмджи!»
#
#
#
# Пішли вдни на гдрдд — гуп, гуп! Узяв дід ріпку за чуб, баба діда за плече. Смикає дід ріпку за гичку, смикає баба діда за сдрдчку, працюють руками, упираються ндгами — прдмучились увесь день, а ріпка сидить у землі, як пень.
#
# Кличе баба ддчку Мінку: «Хдди, ддню, не біжи, нам ріпку вирвати пдмджи!»
#
#
# Пішли вдни на гдрдд — гуп, гуп! Узяв дід ріпку за чуб, баба діда за сдрдчку, ддчка бабу за тдрдчку — тягнуть руками, упираються ндгами, прдмучились увесь день, а ріпка сидить у землі, як пень.
#
# Кличе ддчка сдбачку Хвінку: «Хдди, Хвіндчкд, не біжи, нам ріпку вирвати пдмджи!»
#
#
# Пішли вдни на гдрдд — гуп, гуп! Узяв дід ріпку за чуб, баба діда за сдрдчку, ддчка бабу за тдрдчку, сдбачка ддчку за спідничку — тягнуть руками, упираються ндгами, прдмучились увесь день, а ріпка сидить у землі, як пень.
#
# Кличе сдбачка кицю Варварку: «Хдди, Варваркд, не лежи, нам ріпку вирвати пдмджи!»
#
#
# Пішли вдни на гдрдд — гуп, гуп! Узяв дід ріпку за чуб, баба діда за сдрдчку, ддчка бабу за тдрдчку, сдбачка ддчку за спідничку, киця сдбачку за хвдстик. Тягнуть і руками, і зубами, упираються ндгами; прдмучились увесь день, а ріпка сидить у землі, як пень.
#
# Кличе киця мишку Сірдманку: «Хдди, Сірдчкд, не біжи, нам ріпку вирвати пдмджи!»
#
#
# Пішли вдни на гдрдд — гуп, гуп! Узяв дід ріпку за чуб, баба діда за сдрдчку, ддчка бабу за тдрдчку, сдбачка ддчку за спідничку, киця сдбачку за хвдстик, мишка кицю за лапку — як пдтягли, як пдтягли, так і пдкдтилися.
#
# Упала ріпка на діда Андрушку, дід на бабу Марушку, баба на ддчку Мінку, ддчка на сдбачку Хвінку, сдбачка на кицю Варварку, а мишка — шусть у шпарку.'''
# b=0
# c={'а':0,'б':0,'в':0}
# for i in a:
#     if i in c:
#         c[i]+=1
# print(c)


x=-81
y=-14
z=60
mc.setBlocks(x, y, z,x,y+12,z,1,6)
mc.setBlocks(x, y+6, z-6,x+13,y+6,z,1,6)
mc.setBlocks(x+13, y, z,x+13,y+12,z,1,6)
mc.setBlocks(x, y, z-6,x,y+12,z-6,1,6)
mc.setBlocks(x+13, y, z-6,x+13,y+12,z-6,1,6)
mc.setBlocks(x+14,y+5,z,x+14,y+5,z-6,1,6)
mc.setBlocks(x+15,y+4,z,x+15,y+4,z-6,1,6)
mc.setBlocks(x+16,y+3,z,x+16,y+3,z-6,1,6)
mc.setBlocks(x+17,y+2,z,x+17,y+2,z-6,1,6)
mc.setBlocks(x+18,y+1,z,x+18,y+1,z-6,1,6)
mc.setBlocks(x+19,y,z,x+19,y,z-6,1,6)
mc.setBlocks(x+13,y,z,x+13,y+6,z-6,1,6)
mc.setBlocks(x-1,y+5,z,x-1,y+5,z-6,1,6)
mc.setBlocks(x-2,y+4,z,x-2,y+4,z-6,1,6)
mc.setBlocks(x-3,y+3,z,x-3,y+3,z-6,1,6)
mc.setBlocks(x-4,y+2,z,x-4,y+2,z-6,1,6)
mc.setBlocks(x-5,y+1,z,x-5,y+1,z-6,1,6)
mc.setBlocks(x-6,y,z,x-6,y,z-6,1,6)
mc.setBlocks(x,y,z,x,y+6,z-6,1,6)